#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ecs_service.data.aws_partition.current: Reading...
module.ecs_service.data.aws_caller_identity.current: Reading...
module.alb.data.aws_partition.current: Reading...
data.aws_ssm_parameter.fluentbit: Reading...
module.ecs_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.alb.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Reading...
module.ecs_task_definition.data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.ecs_task_definition.module.container_definition["al2023"].data.aws_region.current: Reading...
module.ecs_service.data.aws_iam_policy_document.tasks[0]: Reading...
module.ecs_task_definition.data.aws_iam_policy_document.task_exec[0]: Reading...
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]
module.ecs_task_definition.data.aws_region.current: Reading...
module.ecs_task_definition.module.container_definition["al2023"].data.aws_region.current: Read complete after 0s [id=ca-central-1]
module.ecs_task_definition.data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]
module.ecs_service.data.aws_iam_policy_document.tasks[0]: Read complete after 0s [id=757765849]
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=1415633931]
module.ecs_task_definition.data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=1415633931]
module.ecs_task_definition.data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Reading...
module.ecs_task_definition.data.aws_region.current: Read complete after 0s [id=ca-central-1]
module.ecs_task_definition.data.aws_partition.current: Reading...
module.ecs_service.data.aws_region.current: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ca-central-1]
module.ecs_task_definition.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=864899849560]
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=587589064]
module.ecs_task_definition.data.aws_caller_identity.current: Read complete after 0s [id=864899849560]
module.ecs_task_definition.data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.ecs_task_definition.data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=587589064]
data.aws_ssm_parameter.fluentbit: Read complete after 0s [id=/aws/service/aws-for-fluent-bit/stable]
module.ecs_service.module.container_definition["fluent-bit"].data.aws_region.current: Reading...
module.ecs_service.module.container_definition["ecsdemo-frontend"].data.aws_region.current: Reading...
module.ecs_service.module.container_definition["ecsdemo-frontend"].data.aws_region.current: Read complete after 0s [id=ca-central-1]
module.ecs_service.module.container_definition["fluent-bit"].data.aws_region.current: Read complete after 0s [id=ca-central-1]
data.aws_availability_zones.available: Read complete after 0s [id=ca-central-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_service_discovery_http_namespace.this will be created
  + resource "aws_service_discovery_http_namespace" "this" {
      + arn         = (known after apply)
      + description = "CloudMap namespace for ex-tf-application"
      + http_name   = (known after apply)
      + id          = (known after apply)
      + name        = "ex-tf-application"
      + tags        = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all    = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "ex-tf-application"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Example"               = "ex-tf-application"
          + "Name"                  = "ex-tf-application"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "Example"               = "ex-tf-application"
          + "Name"                  = "ex-tf-application"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {}
    }

  # module.alb.aws_lb_listener.this["ex_http"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 80
      + protocol                 = "HTTP"
      + ssl_policy               = (known after apply)
      + tags                     = {
          + "Example"               = "ex-tf-application"
          + "Name"                  = "ex-tf-application"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                 = {
          + "Example"               = "ex-tf-application"
          + "Name"                  = "ex-tf-application"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication {
          + ignore_client_certificate_expiry = (known after apply)
          + mode                             = (known after apply)
          + trust_store_arn                  = (known after apply)
        }
    }

  # module.alb.aws_lb_target_group.this["ex_ecs"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "5"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = "true"
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Example"               = "ex-tf-application"
          + "Name"                  = "ex-tf-application"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                           = {
          + "Example"               = "ex-tf-application"
          + "Name"                  = "ex-tf-application"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_group_health {
          + dns_failover {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }

          + unhealthy_state_routing {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

  # module.alb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for ex-tf-application application load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ex-tf-application-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"               = "ex-tf-application"
          + "Name"                  = "ex-tf-application"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Example"               = "ex-tf-application"
          + "Name"                  = "ex-tf-application"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                 = (known after apply)
    }

  # module.alb.aws_vpc_security_group_egress_rule.this["all"] will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Example"               = "ex-tf-application"
          + "Name"                  = "ex-tf-application"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Example"               = "ex-tf-application"
          + "Name"                  = "ex-tf-application"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
    }

  # module.alb.aws_vpc_security_group_ingress_rule.this["all_http"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Example"               = "ex-tf-application"
          + "Name"                  = "ex-tf-application"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Example"               = "ex-tf-application"
          + "Name"                  = "ex-tf-application"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + to_port                = 80
    }

  # module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/ex-tf-application"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all          = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ex-tf-application"
      + tags     = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "DEFAULT"
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "ex-tf-application"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 50
        }
      + default_capacity_provider_strategy {
          + base              = 20
          + capacity_provider = "FARGATE"
          + weight            = 50
        }
    }

  # module.ecs_service.data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "ex-tf-application"
      + task_role_arn        = (known after apply)
    }

  # module.ecs_service.data.aws_subnet.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = (known after apply)
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + available_ip_address_count                     = (known after apply)
      + cidr_block                                     = (known after apply)
      + customer_owned_ipv4_pool                       = (known after apply)
      + default_for_az                                 = (known after apply)
      + enable_dns64                                   = (known after apply)
      + enable_lni_at_device_index                     = (known after apply)
      + enable_resource_name_dns_a_record_on_launch    = (known after apply)
      + enable_resource_name_dns_aaaa_record_on_launch = (known after apply)
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = (known after apply)
      + map_customer_owned_ip_on_launch                = (known after apply)
      + map_public_ip_on_launch                        = (known after apply)
      + outpost_arn                                    = (known after apply)
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + state                                          = (known after apply)
      + tags                                           = (known after apply)
      + vpc_id                                         = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.ecs_service.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs_service.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs_service.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = (known after apply)
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all           = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }

      + suspended_state {
          + dynamic_scaling_in_suspended  = (known after apply)
          + dynamic_scaling_out_suspended = (known after apply)
          + scheduled_scaling_suspended   = (known after apply)
        }
    }

  # module.ecs_service.aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = true
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "ex-tf-application"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "ServiceTag" = "Tag on service level"
        }
      + tags_all                           = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "ServiceTag" = "Tag on service level"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "ecsdemo-frontend"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = (known after apply)

          + service {
              + discovery_name = "ecsdemo-frontend"
              + port_name      = "ecsdemo-frontend"

              + client_alias {
                  + dns_name = "ecsdemo-frontend"
                  + port     = 3000
                }
            }
        }

      + timeouts {}
    }

  # module.ecs_service.aws_ecs_task_definition.this[0] will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu                    = 512
                  + dependsOn              = [
                      + {
                          + condition     = "START"
                          + containerName = "fluent-bit"
                        },
                    ]
                  + environment            = []
                  + essential              = true
                  + image                  = "public.ecr.aws/aws-containers/ecsdemo-frontend:776fd50"
                  + interactive            = false
                  + linuxParameters        = {
                      + capabilities       = {
                          + add  = []
                          + drop = [
                              + "NET_RAW",
                            ]
                        }
                      + initProcessEnabled = true
                    }
                  + logConfiguration       = {
                      + logDriver = "awsfirelens"
                      + options   = {
                          + Name                    = "firehose"
                          + delivery_stream         = "my-stream"
                          + log-driver-buffer-limit = "2097152"
                          + region                  = "ca-central-1"
                        }
                    }
                  + memory                 = 1024
                  + memoryReservation      = 100
                  + mountPoints            = []
                  + name                   = "ecsdemo-frontend"
                  + portMappings           = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                          + name          = "ecsdemo-frontend"
                          + protocol      = "tcp"
                        },
                    ]
                  + privileged             = false
                  + pseudoTerminal         = false
                  + readonlyRootFilesystem = false
                  + startTimeout           = 30
                  + stopTimeout            = 120
                  + systemControls         = []
                  + user                   = "0"
                  + volumesFrom            = [
                      + {
                          + readOnly        = false
                          + sourceContainer = "fluent-bit"
                        },
                    ]
                },
              + {
                  + cpu                    = 512
                  + environment            = []
                  + essential              = true
                  + firelensConfiguration  = {
                      + type = "fluentbit"
                    }
                  + image                  = "906394416424.dkr.ecr.ca-central-1.amazonaws.com/aws-for-fluent-bit:2.32.4"
                  + interactive            = false
                  + linuxParameters        = {
                      + initProcessEnabled = true
                    }
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/ex-tf-application/fluent-bit"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory                 = 1024
                  + memoryReservation      = 50
                  + mountPoints            = []
                  + name                   = "fluent-bit"
                  + portMappings           = []
                  + privileged             = false
                  + pseudoTerminal         = false
                  + readonlyRootFilesystem = true
                  + startTimeout           = 30
                  + stopTimeout            = 120
                  + systemControls         = []
                  + user                   = "0"
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "ex-tf-application"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                 = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs_service.aws_iam_policy.task_exec[0] will be created
  + resource "aws_iam_policy" "task_exec" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Task execution role IAM policy"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "ex-tf-application-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Logs"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECR"
                    },
                  + {
                      + Action   = "ssm:GetParameters"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:*:*:parameter/*"
                      + Sid      = "GetSSMParams"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:*:*:secret:*"
                      + Sid      = "GetSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all         = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.ecs_service.aws_iam_role.task_exec[0] will be created
  + resource "aws_iam_role" "task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecutionAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Task execution role for ex-tf-application"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ex-tf-application-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all              = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs_service.aws_iam_role.tasks[0] will be created
  + resource "aws_iam_role" "tasks" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:ecs:ca-central-1:864899849560:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "864899849560"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTasksAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ex-tf-application-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all              = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs_service.aws_iam_role_policy.tasks[0] will be created
  + resource "aws_iam_role_policy" "tasks" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ex-tf-application-"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECSExec"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.ecs_service.aws_iam_role_policy_attachment.task_exec[0] will be created
  + resource "aws_iam_role_policy_attachment" "task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.ecs_service.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ex-tf-application-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs_service.aws_security_group_rule.this["alb_ingress_3000"] will be created
  + resource "aws_security_group_rule" "this" {
      + description              = "Service port"
      + from_port                = 3000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3000
      + type                     = "ingress"
    }

  # module.ecs_service.aws_security_group_rule.this["egress_all"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ecs_task_definition.data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "ex-tf-application-standalone"
      + task_role_arn        = (known after apply)
    }

  # module.ecs_task_definition.data.aws_subnet.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = (known after apply)
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + available_ip_address_count                     = (known after apply)
      + cidr_block                                     = (known after apply)
      + customer_owned_ipv4_pool                       = (known after apply)
      + default_for_az                                 = (known after apply)
      + enable_dns64                                   = (known after apply)
      + enable_lni_at_device_index                     = (known after apply)
      + enable_resource_name_dns_a_record_on_launch    = (known after apply)
      + enable_resource_name_dns_aaaa_record_on_launch = (known after apply)
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = (known after apply)
      + map_customer_owned_ip_on_launch                = (known after apply)
      + map_public_ip_on_launch                        = (known after apply)
      + outpost_arn                                    = (known after apply)
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + state                                          = (known after apply)
      + tags                                           = (known after apply)
      + vpc_id                                         = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.ecs_task_definition.aws_ecs_task_definition.this[0] will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command                = [
                      + "echo hello world",
                    ]
                  + entryPoint             = [
                      + "/usr/bin/sh",
                      + "-c",
                    ]
                  + environment            = []
                  + image                  = "public.ecr.aws/amazonlinux/amazonlinux:2023-minimal"
                  + interactive            = false
                  + linuxParameters        = {
                      + initProcessEnabled = false
                    }
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/ex-tf-application-standalone/al2023"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + mountPoints            = [
                      + {
                          + containerPath = "/var/www/ex-vol"
                          + sourceVolume  = "ex-vol"
                        },
                    ]
                  + name                   = "al2023"
                  + portMappings           = []
                  + privileged             = false
                  + pseudoTerminal         = false
                  + readonlyRootFilesystem = true
                  + startTimeout           = 30
                  + stopTimeout            = 120
                  + systemControls         = []
                  + user                   = "0"
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "ex-tf-application-standalone"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                 = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "ex-vol"
        }
    }

  # module.ecs_task_definition.aws_iam_policy.task_exec[0] will be created
  + resource "aws_iam_policy" "task_exec" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Task execution role IAM policy"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "ex-tf-application-standalone-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Logs"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECR"
                    },
                  + {
                      + Action   = "ssm:GetParameters"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:*:*:parameter/*"
                      + Sid      = "GetSSMParams"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:*:*:secret:*"
                      + Sid      = "GetSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all         = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.ecs_task_definition.aws_iam_role.task_exec[0] will be created
  + resource "aws_iam_role" "task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecutionAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Task execution role for ex-tf-application-standalone"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ex-tf-application-standalone-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all              = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs_task_definition.aws_iam_role.tasks[0] will be created
  + resource "aws_iam_role" "tasks" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:ecs:ca-central-1:864899849560:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "864899849560"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTasksAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ex-tf-application-standalone-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all              = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs_task_definition.aws_iam_role_policy_attachment.task_exec[0] will be created
  + resource "aws_iam_role_policy_attachment" "task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.ecs_task_definition.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ex-tf-application-standalone-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application-standalone"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application-standalone"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs_task_definition.aws_security_group_rule.this["egress_all"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all             = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                           = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all         = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all         = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.48.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.49.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.50.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                             = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.ecs_service.module.container_definition["fluent-bit"].aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/ex-tf-application/fluent-bit"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all          = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.ecs_task_definition.module.container_definition["al2023"].aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/ex-tf-application-standalone/al2023"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all          = {
          + "Example"    = "ex-tf-application"
          + "Name"       = "ex-tf-application"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

Plan: 55 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_arn                             = (known after apply)
  + cluster_autoscaling_capacity_providers  = {}
  + cluster_capacity_providers              = (known after apply)
  + cluster_id                              = (known after apply)
  + cluster_name                            = "ex-tf-application"
  + service_autoscaling_policies            = {
      + cpu    = {
          + alarm_arns                                   = (known after apply)
          + arn                                          = (known after apply)
          + id                                           = (known after apply)
          + name                                         = "cpu"
          + policy_type                                  = "TargetTrackingScaling"
          + resource_id                                  = (known after apply)
          + scalable_dimension                           = "ecs:service:DesiredCount"
          + service_namespace                            = "ecs"
          + step_scaling_policy_configuration            = []
          + target_tracking_scaling_policy_configuration = [
              + {
                  + customized_metric_specification = []
                  + disable_scale_in                = false
                  + predefined_metric_specification = [
                      + {
                          + predefined_metric_type = "ECSServiceAverageCPUUtilization"
                          + resource_label         = null
                        },
                    ]
                  + scale_in_cooldown               = 300
                  + scale_out_cooldown              = 60
                  + target_value                    = 75
                },
            ]
        }
      + memory = {
          + alarm_arns                                   = (known after apply)
          + arn                                          = (known after apply)
          + id                                           = (known after apply)
          + name                                         = "memory"
          + policy_type                                  = "TargetTrackingScaling"
          + resource_id                                  = (known after apply)
          + scalable_dimension                           = "ecs:service:DesiredCount"
          + service_namespace                            = "ecs"
          + step_scaling_policy_configuration            = []
          + target_tracking_scaling_policy_configuration = [
              + {
                  + customized_metric_specification = []
                  + disable_scale_in                = false
                  + predefined_metric_specification = [
                      + {
                          + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
                          + resource_label         = null
                        },
                    ]
                  + scale_in_cooldown               = 300
                  + scale_out_cooldown              = 60
                  + target_value                    = 75
                },
            ]
        }
    }
  + service_autoscaling_scheduled_actions   = {}
  + service_container_definitions           = {
      + ecsdemo-frontend = {
          + cloudwatch_log_group_arn  = null
          + cloudwatch_log_group_name = null
          + container_definition      = {
              + cpu                    = 512
              + dependsOn              = [
                  + {
                      + condition     = "START"
                      + containerName = "fluent-bit"
                    },
                ]
              + environment            = []
              + essential              = true
              + image                  = "public.ecr.aws/aws-containers/ecsdemo-frontend:776fd50"
              + interactive            = false
              + linuxParameters        = {
                  + capabilities       = {
                      + add  = []
                      + drop = [
                          + "NET_RAW",
                        ]
                    }
                  + initProcessEnabled = true
                }
              + logConfiguration       = {
                  + logDriver = "awsfirelens"
                  + options   = {
                      + Name                    = "firehose"
                      + delivery_stream         = "my-stream"
                      + log-driver-buffer-limit = "2097152"
                      + region                  = "ca-central-1"
                    }
                }
              + memory                 = 1024
              + memoryReservation      = 100
              + mountPoints            = []
              + name                   = "ecsdemo-frontend"
              + portMappings           = [
                  + {
                      + containerPort = 3000
                      + hostPort      = 3000
                      + name          = "ecsdemo-frontend"
                      + protocol      = "tcp"
                    },
                ]
              + privileged             = false
              + pseudoTerminal         = false
              + readonlyRootFilesystem = false
              + startTimeout           = 30
              + stopTimeout            = 120
              + systemControls         = []
              + user                   = "0"
              + volumesFrom            = [
                  + {
                      + readOnly        = false
                      + sourceContainer = "fluent-bit"
                    },
                ]
            }
        }
      + fluent-bit       = {
          + cloudwatch_log_group_arn  = (known after apply)
          + cloudwatch_log_group_name = "/aws/ecs/ex-tf-application/fluent-bit"
          + container_definition      = {
              + cpu                    = 512
              + environment            = []
              + essential              = true
              + firelensConfiguration  = {
                  + type = "fluentbit"
                }
              + image                  = "906394416424.dkr.ecr.ca-central-1.amazonaws.com/aws-for-fluent-bit:2.32.4"
              + interactive            = false
              + linuxParameters        = {
                  + initProcessEnabled = true
                }
              + logConfiguration       = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/ecs/ex-tf-application/fluent-bit"
                      + awslogs-region        = "ca-central-1"
                      + awslogs-stream-prefix = "ecs"
                    }
                }
              + memory                 = 1024
              + memoryReservation      = 50
              + mountPoints            = []
              + name                   = "fluent-bit"
              + portMappings           = []
              + privileged             = false
              + pseudoTerminal         = false
              + readonlyRootFilesystem = true
              + startTimeout           = 30
              + stopTimeout            = 120
              + systemControls         = []
              + user                   = "0"
              + volumesFrom            = []
            }
        }
    }
  + service_id                              = (known after apply)
  + service_name                            = "ex-tf-application"
  + service_security_group_arn              = (known after apply)
  + service_security_group_id               = (known after apply)
  + service_task_definition_arn             = (known after apply)
  + service_task_definition_family          = "ex-tf-application"
  + service_task_definition_family_revision = (known after apply)
  + service_task_definition_revision        = (known after apply)
  + service_task_exec_iam_role_arn          = (known after apply)
  + service_task_exec_iam_role_name         = (known after apply)
  + service_task_exec_iam_role_unique_id    = (known after apply)
  + service_tasks_iam_role_arn              = (known after apply)
  + service_tasks_iam_role_name             = (known after apply)
  + service_tasks_iam_role_unique_id        = (known after apply)
  + task_definition_run_task_command        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @sarabbrainridge, Action: `pull_request`*